IDENTIFICATION DIVISION.
PROGRAM-ID. COMMUNICATIONS-MAPPER.
PULSE SERVICE "communications-cobolish" ON LOCAL.
ROLE CODE_LIBRARIAN.
LIBRARY "communications-normalize" FROM LIBRARIAN.
IMPORT MAPPER "communications-normalize" FROM MAPPER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INBOUND-DATA PIC X(200).
PROCEDURE DIVISION.
    INTEROP PASCALISH "communications-normalize" AS NORMALIZER.
    DISPLAY "COMMUNICATIONS COBOLISH READY".
    GOBACK.
END PROGRAM COMMUNICATIONS-MAPPER.
